In [4]:
import pandas as pd

scores = { 'names' : ['krishna','mahendar','lucky'],
           'age'   : [21,24,15],
           'vill' : ['aler','mkr','aler']}

In [6]:
df = pd.DataFrame(scores)

In [7]:
df

      names  age  vill
0   krishna   21  aler
1  mahendar   24   mkr
2     lucky   15  aler